Revit 2024 API
ApplicationEntryPoint Constructor
Initializes a new instance of the ApplicationEntryPoint class
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ApplicationEntryPoint()
Visual Basic
Public Sub New
Visual C++
public:
ApplicationEntryPoint()
See Also
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace